In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\asus\anaconda3\lib\site-packages (1.0.2)

Data Collection Using Database

In [2]:
import pymysql
import pandas as pd

In [5]:
connection = pymysql.connect(host="localhost",
                             port=3306,
                             user="root",
                             password="root", 
                             database = "rd_db"
                            )

In [6]:
query = "select * from employees"

In [7]:
cursor = connection.cursor()
cursor.execute(query)

6

In [8]:
cursor.fetchall()

((11, 'Swapnil', 4),
 (15, 'Sapna', 1),
 (21, 'Pranav', 3),
 (102, 'Shyam', 2),
 (103, 'Naman', 1),
 (104, 'Jyoti', 1))

In [9]:
pd.read_sql(query, connection)

   emp_id emp_name  dept_id
0      11  Swapnil        4
1      15    Sapna        1
2      21   Pranav        3
3     102    Shyam        2
4     103    Naman        1
5     104    Jyoti        1